{
  "categories": [
    {
      "name": "Beauty & Grooming",
      "slug": "beauty & grooming",
      "products": [
        {
          "subcategory": "Hair Care",
          "slug": "hair care",
          "item": [
            {
              "name": "L’Oreal EverPure Hair Mask",
              "description": "Treat your hair to salon-quality hydration with this deeply restorative treatment specifically formulated for color-treated hair. The sulfate-free, creamy formula penetrates deep into the hair fiber to repair damage and provide intense nourishment without stripping your color. Infused with aromatic botanicals, it leaves your strands feeling exceptionally soft, shiny, and revitalized after just one use. It is the perfect weekly ritual to maintain vibrant color and achieve a smooth, frizz-free finish.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/458zgVq",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/L’Oreal%20EverPure%20Hair%20Mask.png"
            },
            {
              "name": "L’Oreal Hyaluronic Shampoo Set",
              "description": "The L’Oreal EverPure Hyaluron Shampoo and Conditioner set is a skincare-inspired hair care system designed to provide deep hydration for up to 72 hours. Infused with Hyaluronic Acid, the formula replumps dry, dehydrated strands with moisture without weighing them down. This sulfate-free duo leaves hair looking visibly bouncy, shiny, and revitalized while maintaining color vibrancy. It is the ideal daily routine for achieving a soft, healthy-looking \"lit-from-within\" glow for your hair.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/49aH5et",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/L’Oreal%20Hyaluronic%20Shampoo%20Set.png"
            }
          ]
        },
        {
          "subcategory": "Make Up",
          "slug": "make up",
          "item": [
            {
              "name": "L’Oreal Infallible Setting Spray",
              "description": "Lock in your makeup look all day with this lightweight, micro-fine setting spray that prevents fading, smudging, and settling into fine lines. The non-sticky formula creates an invisible shield, ensuring your foundation, eyeshadow, and concealer stay vibrant for up to 24 hours. Just a few mists provide a fresh, just-applied finish that feels breathable on the skin while controlling excess shine. It is the perfect final step for a flawless, long-lasting complexion that stands up to heat and humidity.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4seWvHq",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/L’Oreal%20Infallible%20Setting%20Spray.png"
            },
            {
              "name": "L’Oreal Telescopic Original Mascara",
              "description": "Enhance your lashes with legendary length and precise definition using this iconic lengthening mascara. The specially designed flexible Precision Brush features a flat side to intensify lashes and a comb side to separate them perfectly without clumping. Its smooth formula glides on effortlessly, extending lashes by up to 60% for a dramatic, wide-eyed look. Ideal for sensitive eyes and contact lens wearers, it delivers a clean, smudge-free finish that lasts all day.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3KVn43B",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/L’Oreal%20Telescopic%20Original%20Mascara.png"
            }
          ]
        },
        {
          "subcategory": "Skin Care",
          "slug": "skin care",
          "item": [
            {
              "name": "L’Oreal Anti-Aging Midnight Cream",
              "description": "Transform your skin overnight with a powerful, anti-aging repair boost using the L’Oreal Paris Midnight Cream. Formulated with a patented Antioxidant Recovery Complex, this rich moisturizer works during your skin’s peak renewal hours to smooth deep wrinkles, restore firmness, and repair the moisture barrier up to 1.5x faster. Its luxurious \"wrapping texture\" provides intense hydration without a greasy residue, making it an essential, high-performance addition to your nightly ritual. Add this dermatologist-tested cream to your routine for a visible, radiant glow by morning!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pbVAoq",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/L’Oreal%20Anti-Aging%20Midnight%20Cream.png"
            },
            {
              "name": "L’Oreal Revitalift Triple Power",
              "description": "Visibly transform your skin’s texture and firmness in just one week with the high-performance Revitalift Triple Power Anti-Aging Moisturizer. This dermatologist-validated formula combines three powerhouse ingredients—Pro-Retinol, Vitamin C, and Hyaluronic Acid—to effectively reduce deep wrinkles, brighten skin tone, and intensely hydrate. Its lightweight, non-greasy cream absorbs instantly to leave skin feeling softer and more resilient while acting as a perfect smooth base for makeup. Secure this \"hardworking\" skincare essential today for a visibly younger-looking complexion!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qmgT7G",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/L’Oreal%20Revitalift%20Triple%20Power.png"
            },
            {
              "name": "L’Oreal True Match Glotion",
              "description": "Achieve an instant, sun-kissed glow with this versatile liquid luminizer that hydrates and enhances your natural radiance. Infused with Glycerin and Shea Butter, the lightweight formula nourishes the skin while providing a soft-focus tint for a luminous finish. It can be worn alone for a fresh dewy look, under foundation as a glowing primer, or as a targeted highlighter to define your features. Available in multiple shades, it effortlessly perfects your complexion for a healthy, lit-from-within sparkle.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/44I2XMR",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/L’Oreal%20True%20Match%20Glotion.png"
            },
            {
              "name": "COSRX Hyaluronic Moisturizing Cream",
              "description": "The COSRX Hyaluronic Acid Intensive Cream is a moisture-packed facial moisturizer designed to deliver deep, long-lasting hydration to dry and dehydrated skin. Formulated with high concentrations of Hippophae Rhamnoides Water and Hyaluronic Acid, it creates a protective barrier that seals in moisture while nourishing the skin. The rich, velvety texture absorbs without feeling greasy, helping to reduce the appearance of fine lines and improve skin elasticity. It is an ideal fragrance-free solution for achieving a soft, plump, and healthy-looking complexion.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3LcHYv6",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/COSRX%20Hyaluronic%20Moisturizing%20Cream.png"
            },
            {
              "name": "COSRX Snail Mucin Trio",
              "description": "The COSRX Snail Mucin Trio is a three-step skincare system designed to repair, hydrate, and rejuvenate the skin using snail secretion filtrate. It includes a gentle cleanser to remove impurities, the high-concentration 96% Essence to intensely hydrate, and the 92% All-in-One Cream to lock in moisture and soothe irritation. This routine works effectively to fade dark spots, improve skin texture, and promote a healthy, glowing complexion. It is formulated to be lightweight and non-greasy, making it suitable for all skin types.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4ja0WPn",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/COSRX%20Snail%20Mucin%20Trio.png"
            },
            {
              "name": "COSRX Peptide Skin Booster",
              "description": "The COSRX Peptide Skin Booster is a multi-action serum designed to address six skin concerns, including elasticity, texture, and pore appearance, with a powerful 6-Peptide Complex. This lightweight, water-based formula works as a \"first step\" treatment to enhance the absorption and effectiveness of subsequent skincare products. It leaves the skin feeling smooth, firm, and balanced without any sticky residue, making it suitable for all skin types. Regular use helps to clarify the complexion and provide a healthy, revitalized glow.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3MPV5CX",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/COSRX%20Peptide%20Skin%20Booster.png"
            },
            {
              "name": "COSRX Original Pimple Patches",
              "description": "The COSRX Acne Pimple Master Patch is a thin, hydrocolloid dressing designed to speed up the healing process of inflammatory acne. These patches work by absorbing impurities and excess oil while creating a protective barrier against bacteria and picking. The waterproof material adheres firmly to the skin, helping to flatten blemishes overnight and reduce redness significantly. They are clear, discreet, and suitable for all skin types, making them a must-have for targeted emergency spot treatment.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4p6Ibh8",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/COSRX%20Original%20Pimple%20Patches.png"
            },
            {
              "name": "COSRX Snail Eye Patches",
              "description": "The COSRX Advanced Snail Hydrogel Eye Patches are moisture-rich treatments designed to brighten and plump the delicate under-eye area. Infused with Snail Secretion Filtrate and Niacinamide, these patches deliver intense hydration while helping to diminish the appearance of dark circles and fine lines. The unique honeycomb-textured hydrogel ensures a secure fit, allowing the active ingredients to penetrate deeply for immediate cooling and soothing effects. They are the perfect quick fix for tired, puffy eyes, leaving the skin looking refreshed and revitalized.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pc5NRM",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/COSRX%20Snail%20Eye%20Patches.png"
            },
            {
              "name": "COSRX Glass Skin Kit",
              "description": "The COSRX Glass Skin Kit is a curated four-step routine designed to provide intense hydration and a smooth, luminous complexion. It features the brand's bestsellers, including the Low pH Good Morning Gel Cleanser, Vitamin C 23 Serum, Advanced Snail 96 Mucin Power Essence, and The Retinol 0.1 Cream. These products work in harmony to refine texture, brighten dark spots, and deeply moisturize the skin for a transparent, \"glass-like\" finish.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3MKQ3HX",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/COSRX%20Glass%20Skin%20Kit.png"
            },
            {
              "name": "COSRX Pink Peptide Patches",
              "description": "The COSRX The Vitamin C 23 Serum is a high-concentration treatment designed to fade acne scars and brighten a dull complexion. Formulated with 23% Pure Vitamin C, it works to even out skin tone and improve overall radiance while providing potent antioxidant protection. It is enriched with Super Vitamin E and Hyaluronic Acid to soothe the skin and maintain essential moisture levels. This serum effectively targets hyperpigmentation and fine lines for a smoother, more youthful appearance.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3MHpa7P",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/COSRX%20Pink%20Peptide%20Patches.png"
            },
            {
              "name": "COSRX Snail Sheet Masks",
              "description": "The COSRX Advanced Snail Mucin Glass Glow Mask is a concentrated sheet mask designed to provide immediate hydration and a radiant, \"glass skin\" finish. Infused with a high concentration of Snail Secretion Filtrate, it works to soothe irritated skin, repair damage, and deeply nourish dehydrated areas. The lightweight, breathable sheet adheres closely to the face, ensuring maximum absorption of the essence for a plump and smooth texture. It is an ideal quick treatment for achieving a healthy, glowing complexion before an event or as part of a weekly self-care routine.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pR7GVa",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/COSRX%20Snail%20Sheet%20Masks.png"
            },
            {
              "name": "COSRX Snail Radiance Essence",
              "description": "The COSRX Advanced Snail Radiance Dual Essence features a unique double-formula system that combines the intensive repair of 74.3% Snail Mucin with the brightening power of 5% Niacinamide. This potent blend works simultaneously to plump the skin, fade hyperpigmentation, and strengthen the moisture barrier for a more even-toned complexion. The lightweight, non-sticky texture absorbs quickly, providing an instant glow and long-lasting hydration for tired or dull skin. It is an ideal all-in-one solution for achieving radiant, elastic, and healthy-looking skin.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qoxs2R",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/COSRX%20Snail%20Radiance%20Essence.png"
            },
            {
              "name": "COSRX Snail Gel Cleanser",
              "description": "The COSRX Advanced Snail Mucin Gel Cleanser is a moisturizing and regenerative cleanser formulated with Snail Secretion Filtrate to protect the skin barrier. This sulfate-free, gel-to-foam formula effectively removes impurities and excess oil while maintaining the skin's natural moisture balance. It features a unique, stretchy texture that minimizes friction and is enriched with ingredients to soothe irritation and refine skin texture. It is ideal for all skin types, especially those with sensitive or dehydrated skin looking for a deep yet gentle clean.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/49oonkP",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/COSRX%20Snail%20Gel%20Cleanser.png"
            },
            {
              "name": "COSRX Vitamin C Serum",
              "description": "The COSRX The Vitamin C 23 Serum is a high-concentration treatment designed to fade acne scars and brighten a dull complexion. Formulated with 23% Pure Vitamin C, it works to even out skin tone and improve overall radiance while providing potent antioxidant protection. It is enriched with Super Vitamin E and Hyaluronic Acid to soothe the skin and maintain essential moisture levels. This serum effectively targets hyperpigmentation and fine lines for a smoother, more youthful appearance.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/48QH94f",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/COSRX%20Vitamin%20C%20Serum.png"
            },
            {
              "name": "COSRX Snail Glow Trio",
              "description": "The COSRX Snail Glow Trio is a curated skincare set designed to provide intense hydration and a radiant, \"glass skin\" finish. This three-step routine includes the Advanced Snail Mucin Gel Cleanser to gently purify, the Advanced Snail 96 Mucin Power Essence to repair and plump, and the Advanced Snail 92 All-in-One Cream to lock in moisture. Formulated with high concentrations of snail secretion filtrate, it effectively soothes redness, improves skin elasticity, and revitalizes dull complexions for a smooth, healthy-looking glow.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qgR6xC",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/COSRX%20Snail%20Glow%20Trio.png"
            },
            {
              "name": "CeraVe Daily Moisturizing Cream",
              "description": "The CeraVe Daily Moisturizing Lotion (often referred to as their daily moisturizing cream/lotion) is a lightweight, oil-free moisturizer that helps hydrate the skin and restore its natural barrier. Formulated with three essential ceramides and hyaluronic acid, it utilizes MVE Technology to provide a steady release of hydration throughout the day. The formula is non-comedogenic, fragrance-free, and suitable for use on both the face and body, making it an ideal choice for those with normal to dry skin.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/44E4Xpr",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Daily%20Moisturizing%20Cream.png"
            },
            {
              "name": "CeraVe Anti-Aging Night Cream",
              "description": "The CeraVe Skin Renewing Night Cream is specifically designed to work with your natural circadian rhythm to help restore the skin barrier overnight. Formulated with biomimetic peptides, it helps improve the appearance of tired-looking skin while reducing the look of fine lines and wrinkles. This non-greasy formula also features three essential ceramides to lock in moisture and hyaluronic acid for added hydration. With MVE technology, it ensures a steady release of nourishing ingredients throughout the night so you wake up with a refreshed and rejuvenated complexion",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3YGCuvG",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Anti-Aging%20Night%20Cream.png"
            },
            {
              "name": "CeraVe Lightweight Daily Moisturizer",
              "description": "The CeraVe Daily Moisturizing Lotion is a lightweight, oil-free moisturizer that helps hydrate the skin and restore its natural barrier. Formulated with three essential ceramides and hyaluronic acid, it utilizes MVE Technology to provide a steady release of hydration for up to 24 hours. The non-comedogenic, fragrance-free formula is designed to leave the skin feeling comfortable without a greasy residue, making it an ideal choice for daily use on both the face and body.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4p5ROww",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Lightweight%20Daily%20Moisturizer.png"
            },
            {
              "name": "CeraVe Hydrating Facial Cleanser",
              "description": "The CeraVe Hydrating Facial Cleanser is a gentle, non-foaming wash designed to cleanse and refresh the skin without over-stripping it or leaving it feeling tight and dry. Formulated with three essential ceramides to help restore the skin's barrier and hyaluronic acid to retain moisture, it utilizes MVE Delivery Technology to supply the skin with a steady stream of nourishment. This soap-free and fragrance-free formula is accepted by the National Eczema Association, making it an ideal choice for those with normal to dry skin.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4aoqmql",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Hydrating%20Facial%20Cleanser.png"
            },
            {
              "name": "CeraVe PM Facial Moisturizer",
              "description": "The CeraVe PM Facial Moisturizing Lotion is an ultra-lightweight nighttime treatment designed to hydrate and calm the skin while you sleep. Formulated with three essential ceramides, hyaluronic acid, and niacinamide, it works to restore the skin's natural barrier and soothe any irritation or redness from the day. Using patented MVE Technology, it provides a steady release of moisture throughout the night for 24-hour hydration without clogging pores or leaving a greasy residue.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/45lR27A",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20PM%20Facial%20Moisturizer.png"
            },
            {
              "name": "CeraVe AM Facial Moisturizer",
              "description": "The CeraVe AM Facial Moisturizing Lotion is a multitasking morning essential that provides all-day hydration while protecting the skin from harmful UV rays with Broad Spectrum SPF 30. Formulated with three essential ceramides, hyaluronic acid, and niacinamide, it helps restore the skin’s natural barrier and soothe the complexion without clogging pores. The formula features InVisibleZinc™ Technology, which uses microfine zinc oxide to spread easily and dry with a clear finish, making it an ideal non-greasy base for makeup or daily wear.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3Y58TMn",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20AM%20Facial%20Moisturizer.png"
            },
            {
              "name": "CeraVe Foaming Facial Cleanser",
              "description": "The CeraVe Foaming Facial Cleanser is a refreshing gel-to-foam wash specifically formulated for normal to oily skin to deeply cleanse without stripping away essential moisture. It features a blend of three essential ceramides to support the skin barrier, hyaluronic acid to retain natural hydration, and niacinamide to help calm the skin. This non-drying, fragrance-free formula effectively removes excess oil, dirt, and makeup, leaving the complexion feeling clean and balanced rather than tight or dry.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3KYzlnW",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Foaming%20Facial%20Cleanser.png"
            },
            {
              "name": "CeraVe Body Face Cream",
              "description": "The CeraVe Moisturizing Cream is a rich, non-greasy formula developed with dermatologists to provide deep hydration for dry and very dry skin on both the face and body. It features three essential ceramides to help restore the skin's natural barrier and hyaluronic acid to retain moisture, while patented MVE Delivery Technology ensures a steady release of ingredients for 24-hour hydration. This fragrance-free and non-comedogenic cream absorbs quickly and is gentle enough for sensitive skin, making it an ideal choice for smoothing rough texture and locking in long-lasting moisture.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/496ha7Q",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Body%20Face%20Cream.png"
            },
            {
              "name": "CeraVe Post-Acne Mark Serum",
              "description": "The CeraVe Resurfacing Retinol Serum (commonly known as the post-acne mark serum) is a gentle yet effective treatment designed to reduce the appearance of lingering dark spots and visible pores after breakouts. Formulated with encapsulated retinol, it helps resurface the skin by promoting natural exfoliation without compromising the skin's protective barrier. This lightweight, fast-absorbing serum is enriched with licorice root extract to brighten the complexion, alongside three essential ceramides and niacinamide to soothe the skin and lock in moisture for a smoother, more even-toned appearance.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4jaBlG3",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Post-Acne%20Mark%20Serum.png"
            },
            {
              "name": "CeraVe Anti-Aging Retinol Serum",
              "description": "The CeraVe Skin Renewing Retinol Serum is a gentle, daily-use treatment specifically designed to reduce the appearance of fine lines and wrinkles while improving skin texture and radiance. It features encapsulated retinol, which allows for a slow, steady release into the skin to minimize irritation, making it suitable for all skin types. Enhanced with three essential ceramides to help restore the skin barrier and hyaluronic acid to retain moisture, this non-comedogenic formula provides effective anti-aging benefits while keeping the complexion hydrated and smooth.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4b33CMN",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Anti-Aging%20Retinol%20Serum.png"
            },
            {
              "name": "CeraVe Tinted Mineral Sunscreen",
              "description": "The CeraVe Hydrating Mineral Sunscreen Broad Spectrum SPF 30 Tinted provides 100% mineral protection against UVA and UVB rays while leaving a natural, healthy-looking glow without a white cast. Formulated with Titanium Dioxide and Zinc Oxide, it is designed to blend seamlessly into most skin tones while providing essential hydration through three essential ceramides and hyaluronic acid. This oil-free, non-greasy formula also includes niacinamide to help soothe the skin, making it an excellent choice for those with sensitive skin who want both sun protection and light, sheer coverage.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4avqmoE",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Tinted%20Mineral%20Sunscreen.png"
            },
            {
              "name": "CeraVe Acne Cream Cleanser",
              "description": "The CeraVe Acne Foaming Cream Cleanser is a powerful yet gentle daily wash formulated with 4% Benzoyl Peroxide to clear acne breakouts and prevent new pimples from forming. Unlike traditional acne treatments that can be overly drying, this cream-to-foam formula contains three essential ceramides to maintain the skin's natural barrier and hyaluronic acid to help retain moisture. It is also infused with niacinamide to soothe the skin and reduce redness, making it an effective solution for clearing the complexion while leaving the skin feeling soft and comfortable.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4p6c6Gk",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Acne%20Cream%20Cleanser.png"
            },
            {
              "name": "CeraVe Hydrating Makeup Wipes",
              "description": "The CeraVe Plant-Based Hydrating Makeup Remover Wipes are gentle, biodegradable cloths designed to effectively remove even waterproof makeup and mascara without disrupting the skin's protective barrier. Infused with three essential ceramides and glycerin, these wipes provide lasting hydration while soothing the skin during the cleansing process. The pH-balanced, fragrance-free formula is non-comedogenic and ophthalmologist-tested, making them safe for sensitive skin and the delicate eye area. They offer a convenient, rinse-free solution that leaves the skin feeling clean, soft, and refreshed rather than tight or dry.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4jdnJKk",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Hydrating%20Makeup%20Wipes.png"
            },
            {
              "name": "CeraVe Itch Relief Moisturizing Lotion",
              "description": "The CeraVe Itch Relief Moisturizing Lotion is a fast-acting, dermatologist-developed formula designed to provide temporary relief from itching associated with dry skin, insect bites, and sunburn. It features 1% Pramoxine Hydrochloride, a topical analgesic that provides rapid relief within two minutes and can last for up to eight hours. Formulated with three essential ceramides to help restore the skin's natural barrier, this steroid-free and fragrance-free lotion is non-comedogenic and gentle enough for sensitive skin, making it an ideal choice for calming irritation while providing long-lasting hydration.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4jdgYs7",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Itch%20Relief%20Moisturizing%20Lotion.png"
            },
            {
              "name": "CeraVe Hydrating Facial Toner",
              "description": "The CeraVe Hydrating Facial Toner is a pH-balanced, alcohol-free formula designed to remove lingering impurities after cleansing while boosting the skin's moisture levels. It features three essential ceramides to help restore the skin barrier, hyaluronic acid to lock in hydration, and niacinamide to visibly calm and smooth the skin. This non-drying, non-astringent toner absorbs quickly and leaves the complexion feeling soft, refreshed, and perfectly prepped for the rest of your skincare routine, making it ideal for normal to dry and sensitive skin types.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/49nCgQa",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Hydrating%20Facial%20Toner.png"
            },
            {
              "name": "CeraVe Therapeutic Hand Cream",
              "description": "The CeraVe Therapeutic Hand Cream is a non-greasy, fast-absorbing treatment specifically designed to protect and repair dry, cracked hands. Formulated with three essential ceramides to restore the skin's natural barrier and hyaluronic acid to lock in moisture, it provides a soothing layer of hydration that lasts through multiple hand washings. This fragrance-free and water-resistant cream also contains dimethicone, a skin protectant that helps shield the hands from environmental irritants, making it an essential solution for restoring softness and comfort to hard-working or sensitive skin.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3Yc7i7o",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Therapeutic%20Hand%20Cream.png"
            },
            {
              "name": "CeraVe Soap-Free Facial Bar",
              "description": "The CeraVe Hydrating Cleanser Bar is a soap-free, pH-balanced cleansing bar designed to remove dirt, oil, and makeup while providing long-lasting hydration for the face and body. Formulated with three essential ceramides to help restore the skin's natural barrier and hyaluronic acid to lock in moisture, it features 5% CeraVe Moisturizing Cream to leave skin feeling soft rather than tight. This non-comedogenic and fragrance-free formula is gentle enough for sensitive skin and is accepted by the National Eczema Association, making it a convenient and effective solid alternative to liquid cleansers.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3Nd15pj",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Soap-Free%20Facial%20Bar.png"
            },
            {
              "name": "CeraVe Double Cleanse Balm",
              "description": "The CeraVe Makeup Removing Cleansing Balm is a melting, oil-based formula designed to effectively dissolve long-wear makeup, dirt, and excess oil while leaving the skin feeling nourished. Formulated with three essential ceramides to help restore the skin's natural barrier and jojoba oil to lock in moisture, it rinses off cleanly without leaving a greasy residue. This non-comedogenic, fragrance-free balm is the ideal first step in a double-cleansing routine, providing a deep clean that is gentle enough for sensitive skin and the delicate eye area.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/495fPhh",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Double%20Cleanse%20Balm.png"
            },
            {
              "name": "CeraVe Eye Repair Cream",
              "description": "The CeraVe Eye Repair Cream is a fast-absorbing, non-greasy formula designed to reduce the appearance of dark circles and eye puffiness while deeply hydrating the delicate eye area. It is formulated with three essential ceramides to help restore the skin's natural barrier and a Marine & Botanical Complex that works to brighten and smooth the skin. Using patented MVE Technology for a steady release of moisture, this fragrance-free and ophthalmologist-tested cream is safe for use around the eyes and is ideal for achieving a more rested, refreshed look.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3KNgtbs",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Eye%20Repair%20Cream.png"
            },
            {
              "name": "CeraVe Psoriasis Moisturizing Cream",
              "description": "The CeraVe Psoriasis Moisturizing Cream is a targeted treatment developed with dermatologists to help relieve the symptoms of psoriasis, including itching, scaling, and redness. It is formulated with 2% Salicylic Acid to provide gentle exfoliation and help remove dead skin cells and scales. To prevent irritation, it contains three essential ceramides to help restore the skin barrier, Urea to attract moisture, and Lactic Acid for additional smoothing. This fragrance-free, non-comedogenic cream also includes niacinamide to soothe the skin, making it a powerful yet gentle choice for managing psoriasis flares and maintaining smooth, hydrated skin.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s7mVdU",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Psoriasis%20Moisturizing%20Cream.png"
            },
            {
              "name": "CeraVe Hydrating Micellar Water",
              "description": "The CeraVe Hydrating Micellar Water is an ultra-gentle, 3-in-1 formula that cleanses, hydrates, and removes makeup in a single step without the need for rinsing. Designed to be kind to even the most sensitive skin and eyes, it uses micellar technology to lift away dirt and oil while maintaining the skin’s natural moisture. Like all CeraVe products, it is enriched with three essential ceramides to help restore the skin barrier, along with niacinamide to soothe the skin and hyaluronic acid to lock in hydration. This non-comedogenic and fragrance-free formula leaves the skin feeling refreshed and clean without any greasy residue or tightness.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s1irWe",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/CeraVe%20Hydrating%20Micellar%20Water.png"
            },
            {
              "name": "Elemis Marine Cream SPF30",
              "description": "The Elemis Pro-Collagen Marine Cream SPF 30 is a luxury 3-in-1 anti-aging moisturizer that combines intense hydration with broad-spectrum sun protection. This award-winning gel-cream is clinically proven to reduce the appearance of fine lines and wrinkles in as little as 14 days. It is powered by marine algae Padina Pavonica, which supports skin hydration, alongside Chlorella and Ginkgo Biloba to improve the feeling of skin firmness and elasticity. The ultra-lightweight texture glides on smoothly, leaving a silky-satin finish that makes it an excellent primer for makeup.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/49qxgKF",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Marine%20Cream%20SPF30.png"
            },
            {
              "name": "Elemis Pro-Collagen Cleansing Balm",
              "description": "The Elemis Pro-Collagen Marine Cream SPF 30 is a world-renowned anti-aging moisturizer that combines intense hydration with broad-spectrum sun protection. This lightweight gel-cream uses potent marine actives like Padina Pavonica to significantly reduce the appearance of fine lines and wrinkles while improving skin firmness. It absorbs instantly without any greasy residue, leaving the complexion feeling smooth, rejuvenated, and perfectly primed for makeup. Ideal for all skin types, it offers a luxurious, spa-like experience with 24-hour moisture.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3Yb2grK",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Pro-Collagen%20Cleansing%20Balm.png"
            },
            {
              "name": "Elemis Dynamic Resurfacing Pads",
              "description": "The Elemis Dynamic Resurfacing Facial Pads are dual-action exfoliating pads that physically and chemically resurface the skin for a smoother, more radiant complexion. Powered by patented Tri-Enzyme Technology, they gently break down dead skin cells and encourage natural cell turnover without irritation. These textured pads are enriched with Lactic Acid and a Probiotic Ferment Complex to help even out skin tone and minimize the appearance of pores. With just one swipe, they leave the skin feeling refreshed, refined, and glowing.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3YaWI0w",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Dynamic%20Resurfacing%20Pads.png"
            },
            {
              "name": "Elemis Dynamic Resurfacing Wash",
              "description": "The Elemis creamy cleanser gently smooths away dullness and impurities using enzyme technology to leave your skin looking bright and refreshed. It’s the perfect daily shortcut to a glowing, \"glass skin\" finish without feeling harsh or stripping your natural moisture.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4asb9Ve",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Dynamic%20Resurfacing%20Wash.png"
            },
            {
              "name": "Elemis Superfood Midnight Facial",
              "description": "The Elemis Superfood Midnight Facial is a luxurious prebiotic overnight cream that transforms dry, dull skin into a radiant, hydrated complexion by morning. Infused with Camu Camu, a potent source of Vitamin C, and Cocoa Butter, this silky treatment provides deep nourishment while helping to maintain the skin's moisture barrier. The formula works while you sleep to minimize visible signs of fatigue and leave the skin feeling incredibly soft and replenished. Its indulgent, cream-to-oil texture is suitable for all skin types and delivers a healthy, \"woke up like this\" glow.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4asyHJH",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Superfood%20Midnight%20Facial.png"
            },
            {
              "name": "Elemis Aching Muscle Soak",
              "description": "The Elemis Aching Muscle Super Soak is a powerful therapeutic bath milk designed to soothe tired, overworked muscles and joints after a long day or intense workout. Formulated with a potent blend of Birch, Juniper, Clove, Alpine Lavender, and Blue Chamomile, it helps to warm the body and ease physical tension. This energizing soak creates a deeply relaxing sensory experience that recharges the mind while softening the skin. It is the perfect recovery treatment for anyone looking to relieve aches and restore a sense of overall well-being.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3L7TaZN",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Aching%20Muscle%20Soak.png"
            },
            {
              "name": "Elemis Superfood Facial Oil",
              "description": "The Elemis Superfood Facial Oil is a nutrient-rich, concentrated treatment that delivers a healthy, outdoor glow to dull and tired skin. It features a potent blend of 9 antioxidant-rich Superfoods, including Broccoli, Flaxseed, and Daikon Radish, to deeply nourish and hydrate the complexion. This lightweight, non-greasy oil absorbs quickly to soften the skin's texture and minimize the appearance of dryness. It is the perfect daily supplement for your skincare routine, leaving your face feeling balanced, radiant, and revitalized.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/44GFFHf",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Superfood%20Facial%20Oil.png"
            },
            {
              "name": "Elemis Frangipani Body Oil",
              "description": "The Elemis Frangipani Monoi Body Oil is a luxurious, multi-tasking oil that provides intense hydration for the skin, hair, and nails. Scented with the exotic aroma of Frangipani flowers and infused with moisturizing Monoi and Coconut oils, it leaves the body feeling velvety soft and delicately fragranced. This high-performance oil absorbs quickly into the skin to lock in moisture and provide a healthy, radiant sheen. It is a perfect treat for dry or parched skin, offering a spa-like tropical escape in the comfort of your home.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pfH7b5",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Frangipani%20Body%20Oil.png"
            },
            {
              "name": "Elemis Soothing Apricot Toner",
              "description": "The Elemis Soothing Apricot Toner is a calming, alcohol-free formula designed to balance and refresh sensitive skin without causing dryness. Infused with Apricot Fruit Extract, it provides a cooling sensation while Sweet Betty Flower acts as a natural cleansing agent to remove impurities. This gentle toner helps maintain the skin's natural pH level and leaves the complexion feeling exceptionally soft and hydrated. It is perfectly formulated to prep the skin for moisturizing, providing a soothing, radiant finish that calms redness and irritation.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/493LP5C",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Soothing%20Apricot%20Toner.png"
            },
            {
              "name": "Elemis Superfood Multi Mist",
              "description": "The Elemis Superfood Multi Mist is a refreshing 4-in-1 treatment that hydrates, tones, primes, and sets makeup for a glowing, healthy-looking complexion. Enriched with antioxidant-rich Coconut Water, Rooibos Tea, and vegan Kefir Ferment, it works to balance the skin's microbiome while providing an instant boost of moisture. This ultra-fine mist can be used day and night or throughout the day to revitalize skin, leaving it feeling soft, dewy, and replenished with every spritz.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4plLrFS",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Superfood%20Multi%20Mist.png"
            },
            {
              "name": "Elemis Ultra Smart Night",
              "description": "The Elemis Ultra Smart Pro-Collagen Night Genius is a cutting-edge, revolutionary anti-wrinkle moisturizer that delivers advanced overnight recovery for a strengthened, youthful-looking complexion. Powered by bespoke Ultra Smart Night Restore Technology, it supports the skin's natural repair cycle and fights oxidative stress caused by daily environmental aggressors. This decadently rich, \"cashmere-like\" cream provides 24-hour hydration using a Moisture Plump Complex, visibly reducing deep-set lines while improving firmness and elasticity. By morning, the skin appears re-energized, smoother, and more resilient, with signs of fatigue significantly diminished.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/49roNa4",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Ultra%20Smart%20Night.png"
            },
            {
              "name": "Elemis Hydrating Cleansing Balm",
              "description": "The Elemis Pro-Collagen Cleansing Balm is a best-selling 3-in-1 formula that transforms from a nourishing balm to a makeup-melting oil, and finally into a hydrating milk. Enriched with a unique blend of nine essential oils, including Lavender and Eucalyptus, it provides a spa-like aromatic experience while deep-cleaning the pores. Formulated with Padina Pavonica and Elderberry Oil, it intensely nourishes the skin's moisture barrier, leaving your complexion feeling soft, radiant, and never stripped. It is versatile enough to be used as a daily cleanser or left on for ten minutes as a weekly nourishing facial mask.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/497Qof1",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Hydrating%20Cleansing%20Balm.png"
            },
            {
              "name": "Elemis Lime Ginger Glow",
              "description": "The Elemis Lime and Ginger Salt Glow is an invigorating luxury body scrub that exfoliates, tones, and deeply softens the skin. It features mineral-rich Sea Salt and Lime Peel to buff away dead skin cells, combined with a nourishing base of Sweet Almond, Bergamot, and Coconut oils to lock in moisture. The warming scent of Ginger revitalizes the senses, while the oil-rich formula melts on contact to leave the skin feeling silky-smooth, supple, and delicately fragranced.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/45dYUrO",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Lime%20Ginger%20Glow.png"
            },
            {
              "name": "Elemis Glow Priming Moisturizer",
              "description": "The Elemis Superfood Glow Priming Moisturizer is a versatile 3-in-1 formula that works as a daily moisturizer, a hydrating makeup primer, and a targeted highlighter. Infused with an energizing blend of Kombucha, Fermented Ginger, and Green Tea Seed Oil, it nourishes the skin while providing an instant, dewy radiance. Light-reflecting microminerals help to blur imperfections and enhance your natural glow, leaving the complexion looking smooth and luminous. This prebiotic-enriched cream is the perfect way to prep your skin for a fresh, \"lit-from-within\" finish, whether worn alone or under foundation.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4jecAJk",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Glow%20Priming%20Moisturizer.png"
            },
            {
              "name": "Elemis Anti-Wrinkle SPF Cream",
              "description": "The Elemis Pro-Collagen Marine Cream SPF 30 is a world-renowned anti-aging moisturizer that combines intense hydration with broad-spectrum sun protection. This lightweight gel-cream uses potent marine actives like Padina Pavonica to significantly reduce the appearance of fine lines and wrinkles while improving skin firmness. It absorbs instantly without any greasy residue, leaving the complexion feeling smooth, rejuvenated, and perfectly primed for makeup. Ideal for all skin types, it offers a luxurious, spa-like experience with 24-hour moisture.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/45qSiX8",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Anti-Wrinkle%20SPF%20Cream.png"
            },
            {
              "name": "Elemis Superfood Facial Wash",
              "description": "The Elemis Superfood Facial Wash is a nutrient-dense, gel-based cleanser that acts like a \"green juice\" for your face, leaving skin looking bright and revitalized. Formulated with a supergreen blend of Wheatgrass, Kale, and Nettle, it effectively removes impurities while feeding the skin essential antioxidants and vitamins. Prebiotics are included to help maintain a healthy balance in the skin's microflora, ensuring the complexion feels soft and refreshed rather than stripped. Its cooling, invigorating formula is perfect for waking up dull skin and achieving a healthy, radiant glow.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4sdGJwg",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Elemis%20Superfood%20Facial%20Wash.png"
            }
          ]
        }
      ]
    },
    {
      "name": "Christmas",
      "slug": "christmas",
      "products": [
        {
          "subcategory": "Garlands & Wreaths",
          "slug": "garlands & wreaths",
          "item": [
            {
              "name": "9ft Pre-Lit Christmas Garland",
              "description": "Instantly drape your home in lush, festive greenery with the 9ft Pre-Lit Christmas Garland. Crafted for full, realistic style, lasting durability, and incredibly easy setup, this generously sized garland comes pre-strung with lights, guaranteed to stand out beautifully in photos, social posts, and real life. Due to its convenience and length, availability is limited—add this gorgeous, pre-lit garland to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3MGmbfS",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/9ft%20Pre-Lit%20Christmas%20Garland.png"
            },
            {
              "name": "Flocked Snowy Garland with Pinecones",
              "description": "Bring the magic of a fresh snowfall indoors with the Flocked Snowy Garland with Pinecones. Crafted for realistic, highly textured style, lasting durability, and incredibly easy setup, this garland is heavily flocked and accented with natural pinecones, providing immediate depth and charm. This essential piece guarantees a picturesque, snowy display that stands out dramatically in photos, social posts, and real life. Due to its detailed, high-impact look, availability is limited—add this gorgeous, flocked garland to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s2kgSS",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Flocked%20Snowy%20Garland%20with%20Pinecones.png"
            },
            {
              "name": "Battery Operated Garland for Mantel",
              "description": "Achieve perfect, hassle-free illumination anywhere in your home with the Battery Operated Garland for Mantel. Crafted for flexible style, lasting durability, and incredibly easy, wire-free setup, this garland allows you to drape light perfectly over mantels, shelves, or doorways. This essential piece guarantees a clean display that stands out dramatically in photos, social posts, and real life. Due to its convenient cordless feature, availability is limited—add this essential, battery-operated garland to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4rWg6vH",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Battery%20Operated%20Garland%20for%20Mantel.png"
            },
            {
              "name": "Garland for Staircase Railing",
              "description": "Transform your hallway into a grand holiday entrance with the Garland for Staircase Railing. Crafted for dramatic style, lasting durability, and incredibly easy, secure setup along a banister, this garland offers ample length and fullness for a stunning, winding display. This essential accent piece is guaranteed to stand out beautifully in photos, social posts, and real life. Due to its specific size and purpose, availability is limited—add this gorgeous staircase garland to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s2F7FG",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Garland%20for%20Staircase%20Railing.png"
            },
            {
              "name": "Outdoor Waterproof Garland",
              "description": "Extend your festive decor beyond your doors with the rugged Outdoor Waterproof Garland. Crafted for vibrant style, superior weather resistance, and incredibly easy setup, this garland is built to withstand rain and snow, guaranteeing a beautiful, consistent display on fences, eaves, or mailboxes. This essential piece is guaranteed to stand out boldly in photos, social posts, and real life. Due to its specialized exterior rating, availability is limited—add this reliable, waterproof garland to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4oYqnom",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Outdoor%20Waterproof%20Garland.png"
            },
            {
              "name": "Red Berry and Pinecone Garland",
              "description": "Bring the rich, classic textures of the holidays to your home with the Red Berry and Pinecone Garland. Crafted for traditional, picturesque style, lasting durability, and incredibly easy setup, this garland is guaranteed to create a warm, inviting display that stands out beautifully in photos, social posts, and real life. Due to its essential holiday components, availability is limited—add this gorgeous, accented garland to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/45bOHMs",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Red%20Berry%20and%20Pinecone%20Garland.png"
            },
            {
              "name": "Eucalyptus and Pine Mixed Garland",
              "description": "Achieve a chic, sophisticated blend of textures with the Eucalyptus and Pine Mixed Garland. Crafted for layered, stylish contrast, lasting durability, and incredibly easy setup, this garland features soft blue-green eucalyptus mixed with rich pine sprigs for a designer look. This unique combination guarantees a beautiful, elevated display that stands out elegantly in photos, social posts, and real life. Due to its trendy and sought-after blend, availability is limited—add this gorgeous, mixed-texture garland to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pHnWb0",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Eucalyptus%20and%20Pine%20Mixed%20Garland.png"
            },
            {
              "name": "Beaded Wooden Christmas Garland",
              "description": "Introduce a clean, natural touch to your holiday decorating with the Beaded Wooden Christmas Garland. Crafted for minimalist style, lasting durability, and incredibly easy setup, this garland features smoothly finished wooden beads that offer a unique, rustic-meets-modern texture. This unique piece guarantees a charming, streamlined display that stands out beautifully in photos, social posts, and real life. Due to high demand for this essential Scandinavian look, availability is limited—add this gorgeous, beaded garland to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/48HamOW",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Beaded%20Wooden%20Christmas%20Garland.png"
            },
            {
              "name": "Felt Ball Christmas Garland",
              "description": "Add a playful, tactile element to your decor with the adorable Felt Ball Christmas Garland. Crafted for charming, handcrafted style, lasting durability, and incredibly easy setup, this garland features soft, colorful felt balls strung together, providing a unique texture that works well anywhere. This essential piece guarantees a fun, inviting display that stands out delightfully in photos, social posts, and real life. Due to high demand for this cute style, availability is limited—add this gorgeous garland to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pHqbeq",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Felt%20Ball%20Christmas%20Garland.png"
            },
            {
              "name": "LED Garland with Timer",
              "description": "Maximize convenience and beauty with the LED Garland with Timer. Crafted for consistent style, lasting durability, and incredibly easy setup, this smart garland features a built-in timer that allows you to set it and forget it, guaranteeing a beautiful glow every evening. This essential piece is guaranteed to stand out beautifully in photos, social posts, and real life without manual hassle. Due to its advanced convenience feature, availability is limited—add this gorgeous, timed garland to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s2IX1y",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/LED%20Garland%20with%20Timer.png"
            },
            {
              "name": "Doorway Garland Kit",
              "description": "Create a stunning, welcoming focal point with the Doorway Garland Kit, the perfect comprehensive set to refresh your home's main entrance this season. Crafted for full, dramatic style, lasting durability, and incredibly easy setup tailored specifically for door frames, this essential piece is guaranteed to stand out boldly and beautifully in photos, social posts, and real life. Due to its customized dimensions and complete contents, availability is limited—add this gorgeous doorway kit to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4afCAl4",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Doorway%20Garland%20Kit.png"
            },
            {
              "name": "Pre-Lit Wreath and Garland Set",
              "description": "Create a flawless, harmonized display with the Pre-Lit Wreath and Garland Set. Crafted for uniform style, lasting durability, and incredibly easy, matching setup, this set guarantees a cohesive, beautiful glow for your door and mantle or railing right out of the box. This essential pairing is guaranteed to stand out beautifully in photos, social posts, and real life. Due to its convenience and high demand for matching sets, availability is limited—add this gorgeous, pre-lit set to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4aTScuI",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Pre-Lit%20Wreath%20and%20Garland%20Set.png"
            },
            {
              "name": "24-Inch Pre-Lit Christmas Wreath",
              "description": "Make a brilliant first impression with the 24-Inch Pre-Lit Christmas Wreath. Crafted for full, classic style, lasting durability, and incredibly easy, immediate setup, this generously sized wreath is guaranteed to stand out boldly and beautifully in photos, social posts, and real life. Due to its convenience and ideal size, availability is limited—add this gorgeous, pre-lit wreath to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s2LgS8",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/24-Inch%20Pre-Lit%20Christmas%20Wreath.png"
            }
          ]
        },
        {
          "subcategory": "Gifts",
          "slug": "gifts",
          "item": [
            {
              "name": "Scented Candle Gift Set",
              "description": "Envelop the senses with the perfect present in the form of the Scented Candle Gift Set. Carefully prepared for captivating aromas, extended burn time, and straightforward gifting and display, this set provides an instant ambiance of warmth and irresistible fragrance. This collection ensures an enchanting, high-quality experience that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, comforting gift, stock is severely limited—act now to secure this stunning scented candle set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3Y0FXoH",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Scented%20Candle%20Gift%20Set.png"
            },
            {
              "name": "Hot Chocolate Gift Box",
              "description": "Deliver instant cozy comfort with the Hot Chocolate Gift Box. Thoughtfully packaged for delicious flavors, premium presentation, and straightforward enjoyment, this set provides an immediate sense of warmth and festive indulgence for cold nights. This collection ensures a delightful, high-quality experience that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, heartwarming gift, stock is severely limited—act now to secure this stunning hot chocolate gift box before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qgjn7r",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Hot%20Chocolate%20Gift%20Box.png"
            },
            {
              "name": "Beard Grooming Kit Gift",
              "description": "Elevate his daily routine with the sophisticated Beard Grooming Kit Gift. Carefully assembled for premium performance, impressive longevity, and straightforward application, this kit provides all the tools needed for a sharp, well-maintained look and a feeling of indulgence. This collection ensures a refined, high-quality experience that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, high-utility gift, stock is severely limited—act now to secure this stunning beard grooming kit before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3Y43yop",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Beard%20Grooming%20Kit%20Gift.png"
            },
            {
              "name": "Skincare Gift Set",
              "description": "Offer the gift of glowing confidence with the luxurious Skincare Gift Set, the ideal personal care collection to refresh anyone's aesthetic this season. Exquisitely curated for premium results, impressive longevity of benefit, and straightforward integration into any routine, this collection ensures a refined, high-quality experience that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, self-care offering, stock is severely limited—act now to secure this stunning skincare gift set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qe5feT",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Skincare%20Gift%20Set.png"
            },
            {
              "name": "Coffee Lover Gift Box",
              "description": "Delight any caffeine enthusiast with the exceptional Coffee Lover Gift Box. Thoughtfully composed for rich, invigorating flavors, premium presentation, and straightforward brewing enjoyment, this set provides everything needed for a luxurious morning ritual. This collection ensures an energizing, high-quality experience that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, universally loved gift, stock is severely limited—act now to secure this stunning coffee lover gift box before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s7k30y",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Coffee%20Lover%20Gift%20Box.png"
            },
            {
              "name": "Gourmet Snack Basket",
              "description": "Impress any recipient with the exquisite Gourmet Snack Basket. Carefully curated for diverse, high-end flavors, elegant presentation, and straightforward sharing enjoyment, this basket provides an array of delicious treats perfect for entertaining or indulging. This collection ensures a sophisticated, high-quality experience that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, universally appreciated gift, stock is severely limited—act now to secure this stunning gourmet snack basket before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/44wmrEg",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Gourmet%20Snack%20Basket.png"
            },
            {
              "name": "Holiday Cookie Gift Tin",
              "description": "Share classic holiday cheer with the charming Holiday Cookie Gift Tin. Lovingly prepared for fresh, festive flavors, attractive packaging, and straightforward, immediate enjoyment, this tin provides a delicious assortment of baked goods perfect for sharing at gatherings or enjoying with a hot drink. This collection ensures a warm, high-quality experience that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, beloved holiday gift, stock is severely limited—act now to secure this stunning cookie gift tin before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4jgja1R",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Holiday%20Cookie%20Gift%20Tin.png"
            },
            {
              "name": "Personalized Mug Gift",
              "description": "Give a truly unique and thoughtful present with the Personalized Mug Gift. Uniquely crafted for distinctive, meaningful style, superb longevity, and straightforward, daily use, this mug provides a perfect vessel for their favorite hot beverage and a lasting reminder of your thoughtfulness. This collection ensures a memorable, high-quality experience that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, custom-made gift, stock is severely limited—act now to secure this stunning personalized mug before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s6TkBu",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Personalized%20Mug%20Gift.png"
            },
            {
              "name": "Photo Frame Gift Set",
              "description": "Preserve cherished memories with the elegant Photo Frame Gift Set, the ideal decorative collection to refresh anyone's home aesthetic this season. Finely constructed for sophisticated, classic style, impressive longevity, and straightforward picture placement, this set provides a beautiful way to display beloved moments on walls or tabletops. This collection ensures a personal, high-quality experience that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, sentimental gift, stock is severely limited—act now to secure this stunning photo frame gift set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s3gKHM",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Photo%20Frame%20Gift%20Set.png"
            },
            {
              "name": "Spa Gift Basket",
              "description": "Offer the ultimate escape with the luxurious Spa Gift Basket. Exquisitely curated for relaxing, aromatic sensory pleasure, impressive longevity of benefit, and straightforward, instant enjoyment, this basket provides everything needed for a revitalizing, at-home spa experience. This collection ensures a tranquil, high-quality retreat that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, self-care offering, stock is severely limited—act now to secure this stunning spa gift basket before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4p6aVqC",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Spa%20Gift%20Basket.png"
            }
          ]
        },
        {
          "subcategory": "Home Decor",
          "slug": "home decor",
          "item": [
            {
              "name": "Christmas Throw Pillow Covers Set",
              "description": "Revamp your living area for the festivities with the Christmas Throw Pillow Covers Set, the ultimate decor accessory to instantly revitalize your home's aesthetic this season. Expertly crafted for bold, appealing patterns, superb longevity, and hassle-free application, these covers effortlessly convert your current cushions into stylish holiday focal points. This indispensable set is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this versatile must-have, stock is severely limited—act now to secure these stunning pillow covers before they are gone!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qigO4H",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Christmas%20Throw%20Pillow%20Covers%20Set.png"
            },
            {
              "name": "Christmas Tablecloth Waterproof",
              "description": "Instantly protect and enhance your holiday dining area with the Christmas Tablecloth Waterproof. Meticulously designed for practical, festive style, superior longevity, and hassle-free coverage, this tablecloth guarantees your table remains pristine while providing a vibrant, welcoming look. This indispensable piece is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this highly functional essential, stock is severely limited—act now to secure this stunning, waterproof tablecloth before it is gone!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3Y6TQld",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Christmas%20Tablecloth%20Waterproof.png"
            },
            {
              "name": "Christmas Doormat Welcome Mat",
              "description": "Establish a festive and friendly entrance with the Christmas Doormat Welcome Mat. Robustly constructed for bold, inviting style, superb longevity, and straightforward placement, this mat delivers a charming holiday greeting right at your doorstep while effectively trapping dirt. This indispensable piece is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, high-traffic decor, stock is severely limited—act now to secure this stunning welcome mat before it is gone!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3Y6TQld",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Christmas%20Doormat%20Welcome%20Mat.png"
            },
            {
              "name": "Christmas Chair Cover Set",
              "description": "Transform your dining area into a festive banquet with the Christmas Chair Cover Set. Masterfully tailored for clean, uniform style, superb longevity, and straightforward application, this set instantly elevates the look of your chairs, creating a polished and coordinated holiday setting. This indispensable collection ensures a neat, high-impact ambiance that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, quick-change decor, stock is severely limited—act now to secure this stunning chair cover set before it is gone!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pGBBiF",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Christmas%20Chair%20Cover%20Set.png"
            },
            {
              "name": "Holiday Oven Mitts and Pot Holders",
              "description": "Equip your kitchen for festive cooking with the Holiday Oven Mitts and Pot Holders. Sturdily constructed for practical, cheerful style, exceptional heat resistance, and straightforward hanging display, this set provides essential protection while adding a playful holiday touch to your culinary space. This collection is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, high-utility kitchen decor, stock is severely limited—act now to secure this stunning oven mitts and pot holders set before it is gone!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/48XokLn",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Holiday%20Oven%20Mitts%20and%20Pot%20Holders.png"
            },
            {
              "name": "Christmas Countdown Advent Calendar",
              "description": "Build excitement throughout December with the Christmas Countdown Advent Calendar. Cleverly designed for engaging, traditional style, superb longevity, and straightforward hanging or display, this calendar creates a cherished daily ritual leading up to the holiday. This collection ensures a bright, welcoming look that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, festive tradition, stock is severely limited—act now to secure this stunning advent calendar before it is gone!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qih6bN",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Christmas%20Countdown%20Advent%20Calendar.png"
            }
          ]
        },
        {
          "subcategory": "Ornaments",
          "slug": "ornaments",
          "item": [
            {
              "name": "Crystal Snowflake Ornament",
              "description": "Refresh your holiday décor with the Crystal Snowflake Ornament. Crafted with elegant crystal-style detailing and a timeless snowflake design, this ornament catches and reflects light beautifully, adding a sparkling focal point to your tree, wreaths, or garlands. Lightweight and easy to hang, it brings winter charm and photo-ready brilliance to your home, social posts, and festive moments. Due to seasonal demand for this dazzling accent, availability is limited—add the Crystal Snowflake Ornament to your cart now before it disappears.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3L4SJPZ",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Crystal%20Snowflake%20Ornament%20-%20Shortcut.png"
            },
            {
              "name": "Shatterproof Ball Ornaments Set",
              "description": "Refresh your home this season with the Shatterproof Ball Ornaments Set This set is constructed for classic style, superior drop-proof durability, and incredibly easy hanging, ensuring your tree stands out beautifully in photos, social posts, and real life without the risk of breakage. Due to high demand for this essential, resilient set, availability is limited—add these ornaments to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s7vjub",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Shatterproof%20Ball%20Ornaments%20Set%20-%20Shortcut.png"
            },
            {
              "name": "Red and Gold Ornament Set",
              "description": "Instantly transform your tree with the majestic Red and Gold Ornament Set. This set is put together for rich, festive style, long-lasting durability, and super easy hanging, guaranteeing a truly spectacular look that stands out beautifully in photos, social posts, and real life. Due to high demand for this classic color combination, availability is limited—add these essential, elegant ornaments to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4j3G7oP",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Red%20and%20Gold%20Ornament%20Set%20-%20Shortcut.png"
            },
            {
              "name": "Silver and Blue Ornament Set",
              "description": "Refresh your home with an icy aesthetic using the Silver and Blue Ornament Set. This set is developed for cool, modern style, reliable durability, and super easy hanging, guaranteeing a brilliant, serene display that stands out beautifully in photos, social posts, and real life. Due to high demand for this sophisticated color theme, availability is limited—add these essential, elegant ornaments to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/452o90a",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Silver%20and%20Blue%20Ornament%20Set%20-%20Shortcut.png"
            },
            {
              "name": "Rustic Farmhouse Ornament Set",
              "description": "Give your home that cozy, welcoming feel with the Rustic Farmhouse Ornament Set, the perfect collection to instantly refresh your holiday look this season. This set is assembled for warm, authentic style, solid durability, and incredibly easy hanging, guaranteeing a charming, picturesque display that stands out beautifully in photos, social posts, and real life. Due to high demand for this popular aesthetic, availability is limited—add these essential, cozy ornaments to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3MOdEY2",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Rustic%20Farmhouse%20Stocking%20Set.png"
            },
            {
              "name": "Clear Fillable Ornaments",
              "description": "Unlock endless creativity with the Clear Fillable Ornaments, the perfect blank canvas to personalize and refresh your home's look this season. This set is produced for versatile style, reliable durability, and incredibly easy setup and customization, guaranteeing unique decorations that stand out beautifully in photos, social posts, and real life. Due to their creative potential, availability is limited—add these essential, customizable ornaments to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4515SjQ",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Clear%20Fillable%20Ornaments%20-%20Shortcut.png"
            },
            {
              "name": "Personalized Name Ornaments",
              "description": "Create lasting memories and instantly refresh your home with the thoughtful Personalized Name Ornaments, the perfect touch of customized charm this season. This set is made for unique style and incredibly easy hanging, guaranteeing heartfelt, special decorations that stand out beautifully in photos, social posts, and real life. Due to the high demand for customized items, availability is limited—add these essential, personalized ornaments to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3XViaXf",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Personalized%20Name%20Ornaments%20-%20Shortcut.png"
            },
            {
              "name": "Baby First Christmas Ornament",
              "description": "Capture the magic of a milestone with the Baby First Christmas Ornament. This ornament is designed for sentimental style, lasting durability, and incredibly easy hanging, guaranteeing a precious decoration that stands out beautifully in photos, social posts, and real life. Due to its emotional value and limited yearly stock, availability is highly limited—add this essential, heartwarming ornament to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3Y2dsqD",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Baby%20First%20Christmas%20Ornament%20-%20Shortcut.png"
            },
            {
              "name": "Couples First Christmas Ornament",
              "description": "Mark a beautiful beginning with the Couples First Christmas Ornament, the perfect romantic keepsake to celebrate a special new season together. This ornament is produced for romantic style, lasting durability, and incredibly easy hanging, guaranteeing a memorable decoration that stands out beautifully in photos, social posts, and real life. Due to its emotional value and high demand, availability is highly limited—add this essential, heartwarming ornament to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qizIZA",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Couples%20First%20Christmas%20Ornament%20-%20Shortcut.png"
            },
            {
              "name": "Family Photo Frame Ornament",
              "description": "Personalize your tree and instantly refresh your home with the Family Photo Frame Ornament. This frame is put together for sentimental style, reliable durability, and incredibly easy photo insertion and hanging, guaranteeing a heartfelt decoration that stands out beautifully in photos, social posts, and real life. Due to its personalized appeal, availability is limited—add this essential, special ornament to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3XZIdwu",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Family%20Photo%20Frame%20Ornament%20-%20Shortcut.png"
            },
            {
              "name": "Pet Paw Print Ornament",
              "description": "Complete the look of your holiday setup with the Full, Lush Tree Skirt, the final detail needed to instantly refresh your home this season. This skirt is put together for rich, premium style and long-lasting durability. This essential foundation is guaranteed to make your tree stand out beautifully in photos, social posts, and real life. Due to high demand for this finishing touch, availability is limited—add this gorgeous tree skirt to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s2HFnb",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Pet%20Paw%20Print%20Ornament%20-%20Shortcut.png"
            },
            {
              "name": "Glass Snowflake Ornaments",
              "description": "Achieve an incredibly rich, full illumination effect with the Cluster Christmas Lights. Crafted for intense style, lasting durability, and incredibly easy setup, these lights offer a spectacular, thick sparkle guaranteed to stand out boldly in photos, social posts, and real life. Due to their dramatic visual impact, availability is limited—secure this essential lighting by adding it to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4agZb0D",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Glass%20Snowflake%20Ornaments%20-%20Shortcut.png"
            },
            {
              "name": "Mini Ornaments for Small Trees",
              "description": "Complete your miniature holiday setup with the Mini Ornaments for Small Trees. Crafted for charming style, reliable durability, and super easy hanging, these tiny decorations are perfectly sized to complement tabletop or pencil trees. This set is guaranteed to give your small tree a balanced, beautiful look that stands out in photos, social posts, and real life. Due to high demand for specialized sizes, availability is limited—add these essential mini ornaments to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/452QEuE",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Mini%20Ornaments%20for%20Small%20Trees%20-%20Shortcut.png"
            },
            {
              "name": "Gnome Christmas Ornaments",
              "description": "Bring a touch of playful folklore to your tree with the adorable Gnome Christmas Ornaments. Crafted for charming style, lasting durability, and incredibly easy hanging, these popular characters guarantee a fun, cozy display that stands out delightfully in photos, social posts, and real life. Due to their immense popularity, availability is limited—add these essential, sought-after gnome ornaments to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s2RRMi",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Gnome%20Christmas%20Ornaments%20-%20Shortcut.png"
            },
            {
              "name": "Buffalo Plaid Ornament Set",
              "description": "Infuse your tree with a cozy, rustic charm using the Buffalo Plaid Ornament Set. Crafted for bold, cozy style, lasting durability, and incredibly easy hanging, these patterned ornaments guarantee a warm, inviting display that stands out beautifully in photos, social posts, and real life. Due to high demand for this essential, popular pattern, availability is limited—add this stylish ornament set to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4afkWxQ",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Buffalo%20Plaid%20Ornament%20Set%20-%20Shortcut.png"
            },
            {
              "name": "Metal Snowflake Ornaments",
              "description": "Add a touch of modern, sleek texture to your tree with the Metal Snowflake Ornaments, the ideal accents to refresh your home with contemporary style this season. Crafted for refined, rugged style, outstanding durability, and incredibly easy setup, these durable ornaments provide a beautiful, sophisticated contrast to traditional decor. This set is guaranteed to standout beautifully in photos, social posts, and real life. Due to high demand for this strong, elegant material, availability is limited—add these essential metal ornaments to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3XZ9oHO",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Metal%20Snowflake%20Ornaments%20-%20Shortcut.png"
            },
            {
              "name": "Santa and Reindeer Ornament Set",
              "description": "This charming set features a classic hand-painted Santa Claus paired with his faithful reindeer, finished with glittering gold accents and festive red details. These nostalgic ornaments bring a warm, traditional feel to your holiday tree and are perfect for creating a timeless Christmas display.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/44zfJgJ",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Santa%20and%20Reindeer%20Ornament%20Set%20-%20Shortcut.png"
            },
            {
              "name": "Handmade Knit Ornament Set",
              "description": "Infuse your tree with warmth and texture using the Handmade Knit Ornament Set. Crafted for charming, bespoke style, lasting durability, and incredibly easy hanging, these unique pieces guarantee a delightful, soft display that stands out beautifully in photos, social posts, and real life. Due to the time-intensive process of creation, availability is limited—add these essential, cozy ornaments to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/48FF76W",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Handmade%20Knit%20Ornament%20Set.png"
            },
            {
              "name": "LED Light-Up Ornaments",
              "description": "Add an extra layer of illumination to your tree with the dazzling LED Light-Up Ornaments. Crafted for spectacular style, reliable durability, and incredibly easy setup, these ornaments feature their own internal glow, guaranteeing a vibrant, eye-catching display that stands out dramatically in photos, social posts, and real life. Due to their unique, high-impact appeal, availability is limited—add these essential, glowing ornaments to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qbDjZ0",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/LED%20Light-Up%20Ornaments.png"
            },
            {
              "name": "Nativity Scene Ornament",
              "description": "Center your holiday celebration on its true meaning with the reverent Nativity Scene Ornament. Crafted for classic, meaningful style, lasting durability, and incredibly easy hanging, this beautiful scene guarantees a heartwarming, traditional display that stands out thoughtfully in photos, social posts, and real life. Due to its essential religious importance, availability is limited—add this special, poignant ornament to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/458iIg7",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Nativity%20Scene%20Ornament.png"
            }
          ]
        },
        {
          "subcategory": "Outdoor Decor",
          "slug": "outdoor decor",
          "item": [
            {
              "name": "6ft Inflatable Snowman",
              "description": "Welcome guests with a massive smile using the 6ft Inflatable Snowman. Crafted for huge, cheerful style, reliable, weather-resistant durability, and incredibly easy, quick inflation setup, this iconic figure is guaranteed to stand out boldly in photos, social posts, and real life. Due to high demand for large, visible decor, availability is limited—add this giant inflatable snowman to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4j6kjZD",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/6ft%20Inflatable%20Snowman.png"
            },
            {
              "name": "Inflatable Christmas Tree with Gifts",
              "description": "Create a full, cheerful holiday vignette instantly with the Inflatable Christmas Tree with Gifts. Crafted for vibrant, complete style, reliable, weather-resistant durability, and incredibly easy, quick inflation setup, this festive scene is guaranteed to stand out boldly and beautifully in photos, social posts, and real life. Due to its unique, all-inclusive design, availability is limited—add this fun inflatable scene to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pQB7GM",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Inflatable%20Christmas%20Tree%20with%20Gifts.png"
            },
            {
              "name": "Inflatable Nativity Scene",
              "description": "Share the sacred reason for the season with the Inflatable Nativity Scene. Crafted for classic, detailed style, reliable, weather-resistant durability, and incredibly easy, quick inflation setup, this beautiful scene guarantees a peaceful, poignant display for your yard. This essential religious piece is guaranteed to stand out thoughtfully in photos, social posts, and real life. Due to its traditional importance and high demand, availability is limited—add this beautiful inflatable nativity scene to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pLtMs9",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Inflatable%20Nativity%20Scene.png"
            },
            {
              "name": "LED Lighted Deer Family Set",
              "description": "Achieve a sophisticated, shimmering yard display with the LED Lighted Deer Family Set. Crafted for elegant, classic style, reliable, weather-resistant durability, and incredibly easy setup, these illuminated figures guarantee a stunning, beautiful glow that is visible both day and night. This essential yard accent is guaranteed to stand out boldly and beautifully in photos, social posts, and real life. Due to high demand for this essential, timeless set, availability is limited—add this gorgeous deer family to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3MMc4WL",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/LED%20Lighted%20Deer%20Family%20Set.png"
            },
            {
              "name": "Holiday Yard Stake Light Set",
              "description": "Outline your paths and garden beds with vibrant light using the Holiday Yard Stake Light Set. Crafted for festive style, reliable, weather-resistant durability, and incredibly easy stake-in setup, these lights guarantee a beautiful, well-defined glow that guides visitors and highlights your landscaping. This essential accent set is guaranteed to stand out boldly and beautifully in photos, social posts, and real life. Due to high demand for simple, effective outdoor lighting, availability is limited—add this gorgeous stake light set to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3KJ4GuK",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Holiday%20Yard%20Stake%20Light%20Set.png"
            },
            {
              "name": "Waterproof Holiday Yard Flag Set",
              "description": "Add a rotating touch of festive elegance to your landscaping with the Waterproof Holiday Yard Flag Set. Crafted for vibrant, seasonal style, superior weather-resistant durability, and incredibly easy stake setup, these flags guarantee a bright, welcoming display that withstands rain and snow. This essential accent set is guaranteed to stand out boldly and beautifully in photos, social posts, and real life. Due to its resilience and high demand for porch and garden decor, availability is limited—add this reliable, waterproof flag set to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4apTJso",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Waterproof%20Holiday%20Yard%20Flag%20Set.png"
            }
          ]
        },
        {
          "subcategory": "Stockings",
          "slug": "stockings",
          "item": [
            {
              "name": "Classic Red Christmas Stocking 4-Pack",
              "description": "Complete your mantle display instantly with the Classic Red Christmas Stocking 4-Pack. Crafted for traditional style, lasting durability, and incredibly easy hanging, these generously sized stockings guarantee a uniform, welcoming look that stands out beautifully in photos, social posts, and real life. Due to high demand for this essential set, availability is limited—add this must-have 4-pack to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/48W0wHN",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Classic%20Red%20Christmas%20Stocking%204-Pack.png"
            },
            {
              "name": "Burlap and Lace Stockings Set",
              "description": "Infuse your fireplace with sophisticated texture using the Burlap and Lace Stockings Set. Crafted for charming, layered style, lasting durability, and incredibly easy hanging, these stockings combine natural burlap with delicate lace for a unique look. This set guarantees a picturesque, cozy display that stands out beautifully in photos, social posts, and real life. Due to their unique, high-demand style, availability is limited—add these essential, beautiful stockings to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4q6h4Uy",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Burlap%20and%20Lace%20Stockings%20Set.png"
            },
            {
              "name": "Knit Cable Christmas Stockings",
              "description": "Give your fireplace a warm, handcrafted look with the Knit Cable Christmas Stockings. Crafted for charming, artisanal style, lasting durability, and incredibly easy hanging, these stockings feature a beautiful cable knit pattern that mimics your favorite winter sweater. This set guarantees a soft, inviting display that stands out beautifully in photos, social posts, and real life. Due to their sought-after cozy feel, availability is limited—add these essential, beautiful stockings to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4iZ7IYe",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Knit%20Cable%20Christmas%20Stockings.png"
            },
            {
              "name": "Personalized Name Stockings",
              "description": "Make your mantle uniquely yours with the Personalized Name Stockings. Crafted for heartfelt style, lasting durability, and incredibly easy hanging, these stockings guarantee a special, welcoming display that ensures every family member feels celebrated. This set is guaranteed to stand out beautifully in photos, social posts, and real life. Due to high demand for customized items, availability is limited—add these essential, personalized stockings to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3KVQuyu",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Personalized%20Name%20Stockings.png"
            },
            {
              "name": "Pet Dog Christmas Stocking",
              "description": "Ensure your four-legged family member is included in the celebration with the adorable Pet Dog Christmas Stocking. Crafted for fun, pet-friendly style, lasting durability, and incredibly easy hanging, this dedicated stocking guarantees a heartwarming, complete family display that stands out beautifully in photos, social posts, and real life. Due to high demand from devoted pet owners, availability is limited—add this essential, special stocking to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/48HDohr",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Pet%20Dog%20Christmas%20Stocking.png"
            },
            {
              "name": "Pet Cat Christmas Stocking",
              "description": "Include your feline friend in the festivities with the charming Pet Cat Christmas Stocking. Crafted for whimsical, cat-themed style, lasting durability, and incredibly easy hanging, this dedicated stocking guarantees a unique, heartwarming family display that stands out beautifully in photos, social posts, and real life. Due to high demand from devoted cat owners, availability is limited—add this essential, special stocking to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qiKcbo",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Pet%20Cat%20Christmas%20Stocking.png"
            },
            {
              "name": "Buffalo Plaid Stockings 4-Pack",
              "description": "Create a coordinated, cozy fireplace aesthetic with the Buffalo Plaid Stockings 4-Pack. Crafted for bold, cozy style, lasting durability, and incredibly easy hanging, these four identical stockings guarantee a rich, warm, and inviting display that stands out beautifully in photos, social posts, and real life. Due to high demand for this essential, matching set, availability is limited—add this stylish 4-pack to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qytapR",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Buffalo%20Plaid%20Stockings%204-Pack.png"
            },
            {
              "name": "Luxury Velvet Christmas Stockings",
              "description": "Drape your fireplace in elegance with the Luxury Velvet Christmas Stockings. Crafted for rich, premium style, long-lasting durability, and incredibly easy hanging, these stockings feature a gorgeous velvet finish that catches the light beautifully. This set guarantees a sophisticated, stunning display that stands out dramatically in photos, social posts, and real life. Due to high demand for this essential, luxurious item, availability is limited—add these elegant velvet stockings to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/48ZITqG",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Luxury%20Velvet%20Christmas%20Stockings.png"
            },
            {
              "name": "Mini Stockings for Advent Calendar",
              "description": "Elevate your countdown to Christmas with the Mini Stockings for Advent Calendar. Crafted for adorable scale, reliable durability, and incredibly easy hanging and filling, these tiny pockets guarantee a fun, highly interactive display that stands out delightfully in photos, social posts, and real life. Due to their unique and sought-after functionality, availability is limited—add these essential mini stockings to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pNkGLm",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Mini%20Stockings%20for%20Advent%20Calendar.png"
            },
            {
              "name": "Faux Fur Trimmed Stockings",
              "description": "Add a layer of irresistible softness and warmth to your holiday setup with the Faux Fur Trimmed Stockings. Crafted for cozy, rich style, lasting durability, and incredibly easy hanging, these stockings feature a plush fur cuff that adds a gorgeous, wintry feel. This detail guarantees a sophisticated, welcoming display that stands out beautifully in photos, social posts, and real life. Due to high demand for this essential, luxurious item, availability is limited—add these warm, furry stockings to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3XZlfpa",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Faux%20Fur%20Trimmed%20Stockings.png"
            },
            {
              "name": "Snowman and Santa Stocking Set",
              "description": "Bring classic holiday cheer to your fireplace with the festive Snowman and Santa Stocking Set. Crafted for whimsical, festive style, lasting durability, and incredibly easy hanging, these stockings feature beloved figures that guarantee nostalgic display. This set stands out beautifully in photos, social posts, and real life. Due to their essential and heartwarming appeal, availability is limited—add this classic character stocking set to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3Mz4IpA",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Snowman%20and%20Santa%20Stocking%20Set.png"
            },
            {
              "name": "Family Set of 6 Stockings",
              "description": "Outfit your entire mantle in one go with the Family Set of 6 Stockings. Crafted for uniform style, lasting durability, and incredibly easy hanging, this generous set guarantees a cohesive, welcoming display that celebrates the whole family and stands out beautifully in photos, social posts, and real life. Due to high demand for this essential, large matching set, availability is limited—add this full family set to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pLoxIS",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Family%20Set%20of%206%20Stockings.png"
            },
            {
              "name": "Minimalist White Christmas Stocking",
              "description": "Achieve a chic, serene holiday look with the Minimalist White Christmas Stocking. Crafted for sleek, contemporary style, lasting durability, and incredibly easy hanging, these stockings offer a crisp, bright accent that perfectly complements a modern or Scandinavian aesthetic, that stands out beautifully in photos, social posts, and real life. Due to high demand for this essential, versatile style, availability is limited—add these elegant white stockings to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pHfVCT",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Minimalist%20White%20Christmas%20Stocking.png"
            },
            {
              "name": "Rustic Farmhouse Stocking Set",
              "description": "Bring the cozy, welcoming appeal of the countryside to your fireplace with the Rustic Farmhouse Stocking Set. Crafted for authentic, quaint style, lasting durability, and incredibly easy hanging, these stockings feature natural textures and classic details for a charming, down-to-earth look. This set guarantees a picturesque display that stands out beautifully in photos, social posts, and real life. Due to high demand for this popular aesthetic, availability is limited—add these essential, cozy stockings to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3KC3E3H",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Rustic%20Farmhouse%20Stocking%20Set.png"
            },
            {
              "name": "LED Light-Up Christmas Stockings",
              "description": "Make your fireplace glow with the LED Light-Up Christmas Stockings. Crafted for spectacular style, reliable durability, and incredibly easy hanging, these stockings feature integrated, subtle LED lights that provide a charming sparkle. This unique design guarantees a stunning, high-impact display that stands out dramatically in photos, social posts, and real life. Due to their dazzling effect and high-tech appeal, availability is limited—add these essential, glowing stockings to your cart immediately before they sell out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/452EYYS",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/LED%20Light-Up%20Christmas%20Stockings.png"
            }
          ]
        },
        {
          "subcategory": "Trees",
          "slug": "trees",
          "item": {
            "name": "4ft Slim Artificial Tree",
            "description": "4ft Slim Artificial Tree – the perfect blend of beauty, style and convenience to refresh your home this season. Expertly designed for easy setup and lasting durability. Intensely photogenic, ready for its close up on social media and your home. Limited availability – add it to your cart before it sells out.",
            "priceText": "Click to check",
            "priceUrl": "https://amzn.to/4rYgDxd",
            "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Trees/SLIM%20ARTIFICAL%20TREE.png"
          }
        }
      ]
    },
    {
      "name": "New Year",
      "slug": "new year",
      "products": [
        {
          "subcategory": "Decorations",
          "slug": "decorations",
          "item": [
            {
              "name": "Happy New Year Banner Set",
              "description": "Adorn your venue for the big night with the Happy New Year Banner Set. Rigorously prepared for vibrant, celebratory style, impressive durability, and straightforward hanging, this set provides essential visuals to establish a high-impact, festive backdrop instantly. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning banner set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4p6iJbS",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Happy%20New%20Year%20Banner%20Set.png"
            },
            {
              "name": "2026 Number Foil Balloons",
              "description": "Declare the new year with the brilliant 2026 Number Foil Balloons. Rigorously prepared for vibrant, date-specific style, impressive durability, and straightforward inflation and display, this set provides essential visuals to establish a high-impact, modern, and festive photo backdrop instantly. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning 2026 number balloon set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3Y6jg2o",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/2026%20Number%20Foil%20Balloons.png"
            },
            {
              "name": "New Year Hanging Swirl Decorations",
              "description": "Add dynamic movement and sparkle overhead with the New Year Hanging Swirl Decorations. Rigorously assembled for dazzling, celebratory style, impressive durability, and straightforward hanging and arrangement, this set provides essential visuals that instantly transform your ceiling into a festive spectacle. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning swirl decorations set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4967Lgi",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/New%20Year%20Hanging%20Swirl%20Decorations.png"
            },
            {
              "name": "Black and Gold Balloon Stand",
              "description": "Focus attention on your festive table with the Table Centerpiece Decoration Set. Rigorously assembled for elegant, coordinated style, impressive durability, and straightforward, instant display, this set provides essential visuals to establish a sophisticated and memorable dining atmosphere. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning centerpiece decoration set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pa1y9p",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Black%20and%20Gold%20Balloon%20Stand.png"
            },
            {
              "name": "6 Pack Fairy Lights Battery Operated",
              "description": "Illuminate your celebration with the mesmerizing LED String Lights for NYE Backdrop. Rigorously assembled for brilliant, high-impact glamour, impressive durability, and straightforward, instant hanging, these lights provide essential visual warmth and shimmer that instantly elevate any backdrop or focal point. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning LED string light set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/49m2h2q",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/6%20Pack%20Fairy%20Lights%20Battery%20Operated.png"
            },
            {
              "name": "Glow Stick Party Pack for NYE",
              "description": "Ignite the fun with the electric Glow Stick Party Pack for NYE. Rigorously assembled for vibrant, high-energy lighting, impressive longevity of glow, and straightforward activation, this pack provides essential visuals that instantly turn guests into part of the spectacle. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning glow stick party pack before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qlhmHh",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Glow%20Stick%20Party%20Pack%20for%20NYE.png"
            }
          ]
        },
        {
          "subcategory": "Party Kits",
          "slug": "party kits",
          "item": [
            {
              "name": "Clear Plastic Champagne Flutes",
              "description": "Kick off the countdown with the complete New Year Party Kit for 10 Guests, the ideal celebration solution to refresh your home's aesthetic this season. Rigorously prepared for festive, coordinated style, impressive durability, and straightforward, instant setup, this kit provides everything needed to host a memorable, high-energy event without the fuss. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Given the overwhelming interest in this essential, all-in-one party kit, stock is severely limited—act now to secure this stunning New Year kit before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3MN36Zg",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Clear%20Plastic%20Champagne%20Flutes.png"
            },
            {
              "name": "2026 New Year Party Kit",
              "description": "Celebrate the countdown with modern flair using the Rose Gold New Year Party Kit. Rigorously prepared for trendy, romantic style, impressive durability, and straightforward setup, this kit provides everything needed to host a fashionable, high-impact event without the hassle. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning rose gold New Year kit before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qjN9s4",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/2026%20New%20Year%20Party%20Kit.png"
            },
            {
              "name": "2026 New Year Balloon Kit",
              "description": "Celebrate the arrival of the new year with the specialized 2026 New Year Balloon Kit. Rigorously prepared for vibrant, date-specific style, impressive durability, and straightforward inflation and arrangement, this set provides essential visuals to establish a high-impact, modern, and festive backdrop instantly. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning 2026 balloon kit before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/490yn2f",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/2026%20New%20Year%20Balloon%20Kit.png"
            },
            {
              "name": "New Year Tableware Set for 50 Guests",
              "description": "Host a massive, flawless celebration with the New Year Tableware Set for 50 Guests. Rigorously prepared for coordinated, large-scale style, impressive durability, and straightforward setup and cleanup, this kit provides all the essential plates, cutlery, and cups needed for a significant gathering without the monumental hassle. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning tableware set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4qiIsP7",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/New%20Year%20Tableware%20Set%20for%2050%20Guests.png"
            }
          ]
        },
        {
          "subcategory": "Photo & Fun",
          "slug": "photo & fun",
          "item": [
            {
              "name": "NYE Photo Booth Props Set",
              "description": "Capture every unforgettable moment with the vibrant NYE Photo Booth Props Set. Rigorously assembled for playful, high-impact style, impressive durability, and straightforward, instant deployment, this set provides essential accessories guaranteed to bring laughter and stellar pictures to your celebration. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning photo booth props set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/48PnMsj",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/NYE%20Photo%20Booth%20Props%20Set.png"
            },
            {
              "name": "2026 New Year Headbands",
              "description": "Crown your guests in celebratory fashion with the vibrant 2026 New Year Headbands. Rigorously assembled for date-specific, high-impact style, impressive durability, and straightforward, instant wear, this set provides essential headwear guaranteed to bring cheer and fantastic photos to your event. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning 2026 headbands set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s91Z6r",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/2026%20New%20Year%20Headbands.png"
            }
          ]
        },
        {
          "subcategory": "Tableware & Bar",
          "slug": "tableware & bar",
          "item": [
            {
              "name": "Black Gold Paper Plates Set",
              "description": "Serve your festive bites with sophistication using the Black Gold Paper Plates Set. Rigorously prepared for coordinated, chic style, impressive sturdiness, and straightforward setup and cleanup, this set provides essential pieces for hassle-free hosting. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning black and gold paper plates set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/48Px8nZ",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Black%20Gold%20Paper%20Plates%20Set.png"
            },
            {
              "name": "Plastic Wine Glasses for NYE",
              "description": "Sip your celebratory drinks in safety and style with the Plastic Wine Glasses for NYE. Rigorously prepared for coordinated, sophisticated style, impressive shatterproof durability, and straightforward setup and cleanup, this set provides essential, reliable pieces for hassle-free hosting. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning plastic wine glasses set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pNSnwb",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Plastic%20Wine%20Glasses%20for%20NYE.png"
            },
            {
              "name": "Buffet Serving Tray Set",
              "description": "Present your festive spread beautifully with the Buffet Serving Tray Set. Rigorously prepared for coordinated, functional style, impressive durability, and straightforward setup, this set provides essential pieces for hassle-free serving, keeping your food organized and appealing. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning serving tray set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/48QzsuV",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Buffet%20Serving%20Tray%20Set.png"
            },
            {
              "name": "Charcuterie Board Set Gift",
              "description": "Elevate any gathering with the sophisticated Charcuterie Board Set Gift. Meticulously crafted for distinctive, premium style, impressive durability, and straightforward setup and presentation, this set provides essential pieces for creating a beautiful and engaging food display. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning charcuterie board set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4p9mZr3",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Charcuterie%20Board%20Set%20Gift.png"
            },
            {
              "name": "Cocktail Shaker Set Gift",
              "description": "Master the art of mixology with the essential Cocktail Shaker Set Gift. Meticulously crafted for sleek, premium style, impressive durability, and straightforward use, this set provides essential tools for shaking up sophisticated and celebratory drinks for your guests. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning cocktail shaker set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4j8cqTu",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Cocktail%20Shaker%20Set%20Gift.png"
            },
            {
              "name": "Ice Bucket for Champagne",
              "description": "Keep the celebrations chilled with the elegant Ice Bucket for Champagne. Meticulously crafted for sleek, premium style, impressive insulation, and straightforward use, this bucket provides the essential function of keeping your celebratory drinks perfectly cooled and ready to pour. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning champagne ice bucket before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/493vGNl",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/Ice%20Bucket%20for%20Champagne.png"
            },
            {
              "name": "New Year Coaster Set",
              "description": "Protect your surfaces with style using the New Year Coaster Set. Meticulously crafted for themed, premium style, impressive durability, and straightforward placement, this set provides essential protection against condensation rings while enhancing your party decor. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning New Year coaster set before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4s4lJZ3",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/New%20Year%20Coaster%20Set.png"
            },
            {
              "name": "NYE Bar Decoration Kit",
              "description": "Transform your drink station into a festive focal point with the NYE Bar Decoration Kit. Meticulously curated for cohesive, celebratory style, impressive durability, and straightforward, instant setup, this kit provides essential visuals to instantly elevate your bar area. This collection ensures an exciting, high-quality ambiance that is guaranteed to impress in photos, social media feeds, and in person. Stock is severely limited—act now to secure this stunning NYE bar decoration kit before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4b7CuMy",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Images/NYE%20Bar%20Decoration%20Kit.png"
            }
          ]
        }
      ]
    }
  ]
}
