{
  "categories": [
    {
      "name": "Christmas",
      "slug": "christmas",
      "products": [
        {
          "subcategory": "Trees",
          "slug": "trees",
          "item": [
            {
              "name": "4ft Slim Artificial Tree",
              "description": "4ft Slim Artificial Tree – the perfect blend of beauty, style and convenience to refresh your home this season. Expertly designed for easy setup and lasting durability. Intensely photogenic, ready for its close up on social media and your home. Limited availability – add it to your cart before it sells out.",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4aoK4Ct",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Trees/SLIM%20ARTIFICAL%20TREE.png"
            },
            {
              "name": "5ft Flocked Snowy Tree",
              "description": "Bring the magic of a snowy forest inside with the 5ft Flocked Snowy Tree, the perfect piece to instantly refresh your home this holiday season. Designed with exceptional durability, and effortless setup, this snowy tree is guaranteed to stand out beautifully in every photo, social post, and real-life gathering. Due to limited availability, secure this stunning centerpiece by adding it to your cart before it's sold out",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/3N2PRnh",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Trees/FLOCKED%20SNOWY%20TREE.png"
            },
            {
              "name": "6ft Pre-Lit Warm White Tree",
              "description": "Illuminate your home effortlessly with the 6ft Pre-Lit Warm White Tree, the ideal centerpiece to instantly refresh your space this holiday season. Expertly crafted for superior style, lasting durability, and incredibly easy setup, this tree features a beautiful, warm glow guaranteed to look magnificent in photos, on social media, and in person. Given the limited availability of this popular item, ensure you add it to your cart right away before it sells out!",
              "priceText": "Click to check",
              "priceUrl": "https://amzn.to/4pFlGRJ",
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Trees/PRE%20LIT%20WARM%20WHITE%20TREE.png"
            },
            {
              "name": "6ft Pre-Lit Multicolor Tree",
              "description": "Energize your home instantly with the vibrant 6ft Pre-Lit Multicolor Tree. Expertly designed for durability, this eye-catching tree features an incredibly easy setup, and is guaranteed to be a spectacular centerpiece that shines brightly in photos, social posts, and real life. Limited availability – add it to your cart before it sells out.",
              "priceText": "Click to check",
              "priceUrl": null,
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Trees/PRE%20LIT%20MULTICOLOR%20TREE.png.png"
            },
            {
              "name": "7.5ft Flocked Tree with Pinecones",
              "description": "Elevate your holiday decor with the magnificent 7.5ft Flocked Tree with Pinecones, the ultimate centerpiece designed to instantly refresh your home with rustic, snowy elegance. Guaranteed to look spectacular in every photo, social post, and real-life setting. Made for exceptional style, season-after-season durability, and effortless setup. Availability is severely limited—add this beautiful, natural-looking tree to your cart right now before it sells out.",
              "priceText": "Click to check",
              "priceUrl": null,
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Trees/FLOCKED%20TREE%20WITH%20PINECONES.png"
            },
            {
              "name": "9ft Pre-Lit Artificial Tree",
              "description": "Refresh your home with dazzling light of towering 9ft Pre-Lit Artificial Tree. Crafted for imposing style, long-lasting durability, and easy setup, this magnificent tree is guaranteed to dominate photos, command attention on social media, and provide a breathtaking presence in your home. Limited availability – add it to your cart before it sells out.",
              "priceText": "Click to check",
              "priceUrl": null,
              "image": ""
            },
            {
              "name": "Tabletop Mini Tree with Lights",
              "description": "Instantly refresh any small space, from a desk to a mantel, with the Tabletop Mini Tree with Lights, the perfect piece to add quick holiday cheer this season. This compact tree is made for charming style, lasting durability, and easy setup, guaranteeing a delightful sparkle that stands out in photos, social posts, and real life. Availability is limited due to its popularity, so secure this miniature delight by adding it to your cart now before it sells out!",
              "priceText": "Click to check",
              "priceUrl": null,
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Trees/TABLETOP%20MINI%20TREE.png"
            },
            {
              "name": "Wall-Mounted Half Christmas Tree",
              "description": "Maximize your floor space without sacrificing holiday cheer with the innovative Wall-Mounted Half Christmas Tree, the perfect solution to refresh your home this season. Crafted for exceptional style, durability, and a simple, flush-to-the-wall setup. Due to its unique and highly sought-after nature, availability is limited—add it to your cart before it sells out.",
              "priceText": "Click to check",
              "priceUrl": null,
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Trees/WALL%20MOUNTED%20CHRISTMAS%20TREE.png"
            },
            {
              "name": "Pre-Lit Fiber Optic Tree",
              "description": "Introduce a spectacular light show to your home with the Pre-Lit Fiber Optic Tree, the ultimate piece to refresh your space with ever-changing color this season. This tree is crafted for unique style, outstanding durability. ensuring a vivid display that stands out dramatically in photos, social posts, and real life. Due to its popularity, availability is strictly limited—add this dazzling tree to your cart immediately before it sells out!",
              "priceText": "Click to check",
              "priceUrl": null,
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Trees/PRE%20LIT%20FIBER%20OPTIC%20TREE.png"
            },
            {
              "name": "Pre-Decorated Tree with Ornaments",
              "description": "The Pre-Decorated Tree with Ornaments is the perfect way to instantly refresh your home this season, offering a professionally styled look and lasting durability. Designed for an unbelievably easy, zero-fuss setup, this tree is guaranteed to capture attention in photos, social posts, and real life. Due to limited availability, you must add this convenient, stunning tree to your cart right now!",
              "priceText": "Click to check",
              "priceUrl": null,
              "image": "https://raw.githubusercontent.com/MuhammadWaleedMalik/BuyerCompass/main/src/amazon%20listing%20images/Christmas/Trees/PRE%20DECORATED%20TREE%20WITH%20ORNAMENTS.png"
            }
          ]
        }
      ]
    }
  ]
}
